{
  "header": "# ref/Amplifier_type.py\n#\n# This file contains a Python list of dictionaries, each describing a type of antenna.\n#\n# Author: Anthony Peter Kuzub\n# Blog: www.Like.audio (Contributor to this project)\n#\n# Professional services for customizing and tailoring this software to your specific\n# application can be negotiated. There is no charge to use, modify, or fork this software.\n#\n# Build Log: https://like.audio/category/software/spectrum-scanner/\n# Source Code: https://github.com/APKaudio/\n#\n#\n# Version 1.0 (Initial version)\n",
  "amplifier_types": {
    "Broadband": {
      "Type": "Broadband",
      "Description": "An amplifier designed to provide gain over a wide range of frequencies, from DC to several GHz, suitable for general-purpose signal boosting.",
      "Use": "General-purpose test and measurement, preamplifiers for wideband antennas, and boosting signals for distributed antenna systems."
    },
    "Low_Noise_LNA": {
      "Type": "Low Noise (LNA)",
      "Description": "Specifically designed to amplify very weak signals while adding the minimum amount of noise possible, crucial for high-sensitivity receivers.",
      "Use": "Radio astronomy, satellite communication ground stations, preamplifiers for spectrum analyzers, and deep space communication."
    },
    "High_Power_HPAs": {
      "Type": "High Power (HPAs)",
      "Description": "Designed to provide significant power gain to a signal, often used as the final stage of a transmitter to increase transmission range or strength.",
      "Use": "Broadcast transmitters, radar systems, base stations for mobile networks, and satellite uplink communication."
    },
    "Band_Specific": {
      "Type": "Band-Specific",
      "Description": "Optimized to amplify signals within a narrow, specific frequency range, rejecting signals outside of that band.",
      "Use": "Cellular signal boosters for a specific band, TV channel amplifiers, and filtering systems where only a particular frequency range is of interest."
    },
    "Logarithmic": {
      "Type": "Logarithmic",
      "Description": "An amplifier whose output voltage is proportional to the logarithm of the input voltage, used for compressing a wide range of signal strengths into a smaller, more manageable range.",
      "Use": "Radar receivers, RF power detectors, and spectrum analyzers to display a wide range of signal levels (e.g., in dBm)."
    }
  }
}