{
    "Report": {
        "Active": "true",
        "operator_name": "Anthony Peter Kuzub ",
        "operator_contact": "I@like.audio",
        "venue_name": "Default Venue",
        "venue_address": "123 Main St",
        "venue_city": "Anytown",
        "venue_province": "ON",
        "venue_postal_code": "A1B 2C3",
        "notes": "This is a default report generated by the OPEN-AIR software.",
        "scanner_type": "Generic RF Scanner"
    },

    "Amplifier": {
        "Broadband": {
            "Selected": "yes",
            "Type": "Broadband",
            "Description": "An amplifier designed to provide gain over a wide range of frequencies, from DC to several GHz, suitable for general-purpose signal boosting.",
            "Use": "General-purpose test and measurement, preamplifiers for wideband antennas, and boosting signals for distributed antenna systems."
        },
        "Low_Noise_LNA": {
            "Selected": "no",
            "Type": "Low Noise (LNA)",
            "Description": "Specifically designed to amplify very weak signals while adding the minimum amount of noise possible, crucial for high-sensitivity receivers.",
            "Use": "Radio astronomy, satellite communication ground stations, preamplifiers for spectrum analyzers, and deep space communication."
        },
        "High_Power_HPAs": {
            "Selected": "no",
            "Type": "High Power (HPAs)",
            "Description": "Designed to provide significant power gain to a signal, often used as the final stage of a transmitter to increase transmission range or strength.",
            "Use": "Broadcast transmitters, radar systems, base stations for mobile networks, and satellite uplink communication."
        },
        "Band_Specific": {
            "Selected": "no",
            "Type": "Band-Specific",
            "Description": "Optimized to amplify signals within a narrow, specific frequency range, rejecting signals outside of that band.",
            "Use": "Cellular signal boosters for a specific band, TV channel amplifiers, and filtering systems where only a particular frequency range is of interest."
        },
        "Logarithmic": {
            "Selected": "no",
            "Type": "Logarithmic",
            "Description": "An amplifier whose output voltage is proportional to the logarithm of the input voltage, used for compressing a wide range of signal strengths into a smaller, more manageable range.",
            "Use": "Radar receivers, RF power detectors, and spectrum analyzers to display a wide range of signal levels (e.g., in dBm)."
        }
    },
    "Antenna": {
        "Omnidirectional_Dipole": {
            "Selected": "yes",
            "Type": "Omnidirectional (Dipole)",
            "Description": "Radiates and receives signals equally well in all horizontal directions. Simple and widely used.",
            "Use": "FM radio, Wi-Fi routers, short-range communication, general broadcasting."
        },
        "Omnidirectional_Ground_Plane": {
            "Selected": "no",
            "Type": "Omnidirectional (Ground Plane)",
            "Description": "A vertical radiator with horizontal radials acting as a ground plane, providing omnidirectional coverage.",
            "Use": "VHF/UHF communication, amateur radio, base stations for mobile radio."
        },
        "Directional_Yagi_Uda": {
            "Selected": "no",
            "Type": "Directional (Yagi-Uda)",
            "Description": "Consists of a driven element, a reflector, and one or more directors. Highly directional with good gain.",
            "Use": "TV reception, amateur radio, point-to-point communication, long-distance communication."
        },
        "Directional_Parabolic_Dish": {
            "Selected": "no",
            "Type": "Directional (Parabolic Dish)",
            "Description": "A large, curved reflector that focuses electromagnetic waves to or from a feed antenna at its focal point, providing very high gain and narrow beamwidth.",
            "Use": "Satellite communication, radar, radio astronomy, microwave links."
        },
        "Loop_Antenna": {
            "Selected": "no",
            "Type": "Loop Antenna",
            "Description": "A closed-loop conductor. Can be small (resonant) or large (non-resonant), with varying directional properties depending on size and configuration.",
            "Use": "AM radio reception, RFID, direction finding, amateur radio (especially for lower frequencies)."
        },
        "Patch_Antenna": {
            "Selected": "no",
            "Type": "Patch Antenna",
            "Description": "A flat, rectangular or circular metal patch mounted over a ground plane. Compact and low-profile.",
            "Use": "GPS devices, mobile phones, satellite communication, Wi-Fi access points."
        },
        "Horn_Antenna": {
            "Selected": "no",
            "Type": "Horn Antenna",
            "Description": "A flared metal waveguide, used for directing radio waves in a beam. High gain and good impedance matching.",
            "Use": "Microwave communication, radar, satellite tracking, measurement systems."
        }
    }
}